W7D2/MusicApp/app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands"
---
    def new
        @album = Album.new
        @bands = Band.all

INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "This is so difficult"], ["year", 2021], ["band_id", 2], ["live", true], ["created_at", "2020-05-19 23:49:29.358500"], ["updated_at", "2020-05-19 23:49:29.358500"]]
---
    def create
        album = Album.new(album_params)
        if album.save