W7D2/MusicApp/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "The Beatles"], ["created_at", "2020-05-19 22:12:58.630846"], ["updated_at", "2020-05-19 22:12:58.630846"]]
---
    def create
        band = Band.new(band_params)
        if band.save