W7D5/RedditClone/app/views/subs/index.html.erb

<br>
<% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"