W6D3/new_project/app/controllers/artworks_controller.rb

    def index
        debugger
        user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]