W6D3/new_project/app/controllers/comments_controller.rb

    def index
        if params.has_key?(:user_id)
            user_comment = User.find(params[:user_id])
            render json: user_comment.comments
        elsif params.has_key?(:artwork_id)
            art = Artwork.find(params[:artwork_id])
            render json: art.comments
        else
            comments = Comment.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"

    def create
        comment = Comment.new(comment_params)
        if comment.save!
---
INSERT INTO "comments" ("user_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 6], ["artwork_id", 6], ["body", "I need a selfie with this!"]]

    def destroy
        comment = Comment.find(params[:id])
        if comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 16]]