W6D3/new_project/app/controllers/users_controller.rb

    def index
        if params[:query]
            user = User.where("username like '%#{params[:query]}%'")
            render json: user
        else
            users = User.all
---
SELECT "users".* FROM "users" WHERE (username like '%she%')
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)
        if user.save!
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-05-15 04:44:42.616378"], ["updated_at", "2020-05-15 04:44:42.616378"], ["username", "Teemo"]]