W7D5/RedditClone/app/controllers/posts_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        @sub = Sub.find_by(id: params[:sub_id])

INSERT INTO "posts" ("title", "url", "content", "user_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "   Crookshanks is so smart. I have no regrets! I love him :)"], ["updated_at", "2020-05-22 23:38:02.742115"], ["id", 8]]
---
    def update
        @post = Post.find_by(id: params[:id])
        if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 10], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 10]]
---
    def destroy
        @post = current_user.posts.find_by(id: params[:post_id])
        if @post.destroy