W7D5/RedditClone/app/controllers/subs_controller.rb

    def update
        @sub = Sub.find_by(id: params[:id])
        if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "   trash talk :P Hungry hangry ; love lunch! yayyyyy"], ["updated_at", "2020-05-22 19:22:42.013972"], ["id", 1]]