W7D5/RedditClone/app/views/posts/new.html.erb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
<h3>Let's create a new post for Sub: <%= Sub.find(params[:sub_id]).title %></h3>